from random import randint

#11111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111
a, b, c = 2, 3, 4
if a + b < c or b + c < a or c + a < b: print('треугольника с такими сторонами не существует')
else:
    if a != b != c != a: print('треугольник разносторонний')
    elif a == b == c: print('треугольник равносторонний')
    else: print('треугольник равнобедренный')

#22222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222
num = 2
user_num = int(input('введите число от 0 до 100000: '))
if user_num == 0 or user_num == 1: print(user_num, '- не является: ни простым, ни составным числом')   
elif user_num > 0 and user_num < 100000:
    while num <= user_num:
        if user_num == num: 
            print(user_num, '- является простым числом')
            break
        elif user_num % num == 0: 
            print(user_num, '- является составным числом')
            break
        else: 
            num += 1
else: print('некорректное число')   

#33333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333
attempts = 10
num = randint(0, 1000)
while attempts > 0:
    print('угадайте число от 0 до 1000 (осталось попыток -',  attempts, '):')
    user_num = int(input('>>> '))
    attempts -= 1
    if num == user_num: 
        print('верно, загаданное число -', num)
        exit()
    elif num > user_num: print('неверно, загаданное число больше') 
    else: print('неверно, загаданное число меньше') 
print('попытки закончились, загаданное число - ', num)